# CancellationListener Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CancellationListener Properties
CancellationListener Class See Also
---
The CancellationListener type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
CancellationListener Class
Autodesk.Revit.DB Namespace